ezois_ka/oooezoiskaobmen/src/InformationRegisters/РегистрацииЗапросовСтатусовВыплатыПособий/РегистрацииЗапросовСтатусовВыплатыПособий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииЗапросовСтатусовВыплатыПособий</name>
  <comment>Типы СЭДО 85, 8510.</comment>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ЗапросСтатусовВыплатыПособия</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаУспех</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправленОператору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиОператору</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиФЛК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияУспех</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСсылка</name>
    <type>
      <types>DocumentRef.СтатусыВыплатыПособия</types>
    </type>
  </resources>
  <attributes>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибкиФЛК</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/ЗапросСтатусовВыплатыПособия/ЗапросСтатусовВыплатыПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросСтатусовВыплатыПособия</name>
  <comment>Типы СЭДО 85, 8510.</comment>
  <basedOn>Document.ПриемНаРаботу</basedOn>
  <basedOn>Document.НесоответствиеСведенийОЗастрахованномЛицеСЭДО</basedOn>
  <basedOn>Document.БольничныйЛист</basedOn>
  <basedOn>Document.ВходящийЗапросФССДляРасчетаПособия</basedOn>
  <basedOn>Document.ОтветНаЗапросФССДляРасчетаПособия</basedOn>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНаЗапрос</name>
    <type>
      <types>DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьПроверкиПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИдентификаторРеестра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/СтатусыВыплатыПособия/СтатусыВыплатыПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СтатусыВыплатыПособия</name>
  <comment>Тип СЭДО 85.</comment>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ЗапросСтатусовВыплатыПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОВыплатах</name>
    <attributes>
      <name>ИдентификаторСтрокиРеестра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРеестра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникСНИЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусВыплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удержано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобработанныеУзлы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСодержимого</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/РегистрацииЗапросовСтатусовВыплатыПособий/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ИсходящийДокумент)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ИсходящийДокумент)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// АПК:581-выкл. Методы могут вызываться из расширений.
// АПК:299-выкл. Методы могут вызываться из расширений.
// АПК:326-выкл. Методы поставляются комплектом и предназначены для совместного последовательного использования.
// АПК:325-выкл. Методы поставляются комплектом и предназначены для совместного последовательного использования.
// Транзакция открывается в методе НачатьЗаписьНабора, закрывается в ЗавершитьЗаписьНабора, отменяется в ОтменитьЗаписьНабора.

// Транзакционный вариант (с управляемой блокировкой) получения набора записей, соответствующего значениям измерений.
//
// Параметры:
//   ИдентификаторСообщения - Строка - Значение отбора по соответствующему измерению.
//
// Возвращаемое значение:
//   РегистрСведенийНаборЗаписей.РегистрацииЗапросовСтатусовВыплатыПособий - Если удалось установить блокировку
//       и прочитать набор записей. При необходимости, открывает свою локальную транзакцию. Для закрытия транзакции
//       следует использовать одну из терминирующих процедур: ЗавершитьЗаписьНабора, либо ОтменитьЗаписьНабора.
//   Неопределено - Если не удалось установить блокировку и прочитать набор записей.
//       Вызывать процедуры ЗавершитьЗаписьНабора, ОтменитьЗаписьНабора не требуется,
//       поскольку если перед блокировкой функции потребовалось открыть локальную транзакцию,
//       то после неудачной блокировки локальная транзакция была отменена.
//
Функция НачатьЗаписьНабора(ИдентификаторСообщения) Экспорт
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПолныеПраваИлиПривилегированныйРежим = Пользователи.ЭтоПолноправныйПользователь();
	Если Не ПолныеПраваИлиПривилегированныйРежим
		И Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.РегистрацииЗапросовСтатусовВыплатыПособий) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Недостаточно прав для изменения регистра ""%1"".'"),
			Метаданные.РегистрыСведений.РегистрацииЗапросовСтатусовВыплатыПособий.Представление());
	КонецЕсли;
	ЛокальнаяТранзакция = Не ТранзакцияАктивна();
	Если ЛокальнаяТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РегистрацииЗапросовСтатусовВыплатыПособий");
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторСообщения", ИдентификаторСообщения);
		Блокировка.Заблокировать();
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Прочитать();
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЛокальнаяТранзакция", ЛокальнаяТранзакция);
	Исключение
		Если ЛокальнаяТранзакция Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось изменить регистрацию запроса сведений о выплате пособия %1 по причине: %2'"),
			ИдентификаторСообщения,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.РегистрацииЗапросовСтатусовВыплатыПособий,
			ИдентификаторСообщения,
			ТекстСообщения);
		НаборЗаписей = Неопределено;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НаборЗаписей;
КонецФункции

// Записывает набор и фиксирует локальную транзакцию, если она была открыта в функции НачатьЗаписьНабора.
//
// Параметры:
//   НаборЗаписей - РегистрСведенийНаборЗаписей.РегистрацииЗапросовСтатусовВыплатыПособий
//
Процедура ЗавершитьЗаписьНабора(НаборЗаписей) Экспорт
	НаборЗаписей.Записать(Истина);
	ЛокальнаяТранзакция = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НаборЗаписей.ДополнительныеСвойства, "ЛокальнаяТранзакция");
	Если ЛокальнаяТранзакция = Истина Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

// Отменяет запись набора и отменяет локальную транзакцию, если она была открыта в функции НачатьЗаписьНабора.
//
// Параметры:
//   НаборЗаписей - РегистрСведенийНаборЗаписей.РегистрацииЗапросовСтатусовВыплатыПособий
//
Процедура ОтменитьЗаписьНабора(НаборЗаписей) Экспорт
	ЛокальнаяТранзакция = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НаборЗаписей.ДополнительныеСвойства, "ЛокальнаяТранзакция");
	Если ЛокальнаяТранзакция = Истина Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры

// АПК:326-вкл.
// АПК:325-вкл.
// АПК:299-вкл.
// АПК:581-вкл.

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область СЭДО

Процедура ЗаполнитьПоДокументу(Запись, ИсходящийДокументОбъект) Экспорт
	Запись.ИсходящийДокумент   = ИсходящийДокументОбъект.Ссылка;
	Запись.ГоловнаяОрганизация = ИсходящийДокументОбъект.ГоловнаяОрганизация;
	Запись.Страхователь        = ИсходящийДокументОбъект.Страхователь;
КонецПроцедуры

// Загружает ошибку логического контроля (тип 14) полученную в ответ на документ СЭДО 84 / 8410.
Процедура ЗагрузитьОшибкуСообщения(ТипСообщения, Страхователь, ИдентификаторСообщения, ТекстОшибки, Результат) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = НачатьЗаписьНабора(ИдентификаторСообщения);
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
	Иначе
		Запись = Набор[0];
	КонецЕсли;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ГоловнаяОрганизация    = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
	Запись.Страхователь           = Страхователь;
	Запись.ЕстьОшибкиФЛК          = Истина;
	Запись.ТекстОшибкиФЛК         = ТекстОшибки;
	ЗаполнитьСостояниеРегистрации(Запись);
	
	ЗавершитьЗаписьНабора(Набор);
КонецПроцедуры

// Загружает сообщение СЭДО 85/8510, которое является ответом Фонда на получение статусы выплаты (84/8410).
Процедура ЗагрузитьСообщение85(Страхователь, ИдентификаторСообщения85, ТекстXML, Результат, Кэш) Экспорт
	// Пример 85/8510:
	//<paymentStatusResponse responseOn="05f895d0-0152-439d-9cda-2fe679aeb3af" xmlns="http://www.fss.ru/integration/types/pvso/paymentstate/v01">
	//    <paymentStatusList>
	//        <paymentStatusDetail>
	//            <batchNo>P_7713000050_2022_05_20_141_0:1</batchNo>
	//            <socialAssistNum>141</socialAssistNum>
	//            <SNILS>10845144037</SNILS>
	//            <paymentState>1</paymentState>
	//        </paymentStatusDetail>
	//    </paymentStatusList>
	//</paymentStatusResponse>
	
	СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
	КореньDOM = СериализацияБЗК.НайтиУзелDOMПоИмени(СтруктураDOM, "paymentStatusResponse");
	Если КореньDOM = Неопределено Тогда
		КореньDOM = СтруктураDOM.ДокументDOM;
	КонецЕсли;
	Если КореньDOM = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаУзла(Результат, "paymentStatusResponse");
		Возврат;
	КонецЕсли;
	НеобработанныеУзлы = Новый Массив;
	
	АтрибутыКорня = СериализацияБЗК.АтрибутыЭлементаDOM(КореньDOM, "responseOn");
	ИдентификаторСообщения84 = АтрибутыКорня.responseOn;
	Если ИдентификаторСообщения84 = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаАтрибута(Результат, "responseOn");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторСообщения84) Тогда
		СЭДОФСС.ЗаписатьОшибкуЗаполненностиАтрибута(Результат, "responseOn");
		Возврат;
	КонецЕсли;
	
	ИменаПолей = "paymentStatusList, errorInfo, errorList";
	РеквизитыКорня = СериализацияБЗК.УзлыЭлементаDOM(КореньDOM, ИменаПолей, НеобработанныеУзлы);
	ТаблицаСведенийОВыплатах = ТаблицаСведенийОВыплатахXML(РеквизитыКорня.paymentStatusList, НеобработанныеУзлы);
	РегистрацияТекстОшибки = "";
	Если РеквизитыКорня.errorList <> Неопределено Тогда
		РегистрацияТекстОшибки = ПредставлениеСпискаОшибокXML(РеквизитыКорня.errorList);
	ИначеЕсли РеквизитыКорня.errorInfo <> Неопределено Тогда
		УзлыОшибки = СериализацияБЗК.УзлыЭлементаDOM(РеквизитыКорня.errorInfo, "errorList", НеобработанныеУзлы);
		Если УзлыОшибки.errorList <> Неопределено Тогда
			РегистрацияТекстОшибки = СЭДОФСС.ПредставлениеСпискаОшибокXML(УзлыОшибки.errorList);
		КонецЕсли;
	КонецЕсли;
	
	Набор = НачатьЗаписьНабора(ИдентификаторСообщения84);
	Попытка
		Если Набор.Количество() = 0 Тогда
			ИсходящееСообщение = СЭДОФСС.ИсходящееСообщение(ИдентификаторСообщения84);
			Запись = Набор.Добавить();
			Запись.ИдентификаторСообщения      = ИдентификаторСообщения84;
			Запись.ДоставкаУспех               = Истина; // По факту наличия сообщения 85.
			Запись.ДоставкаДата                = ИсходящееСообщение.Дата;
			Запись.ДоставкаИдентификаторПакета = ИсходящееСообщение.ИдентификаторПакетаФСС;
			Запись.ИсходящийДокумент           = Документы.ЗапросСтатусовВыплатыПособия.НайтиПоРеквизиту("ИдентификаторСообщения",
				ИдентификаторСообщения84);
		Иначе
			Запись = Набор[0];
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Страхователь) Тогда
			Запись.Страхователь = Страхователь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.ГоловнаяОрганизация) Тогда
			Запись.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
		КонецЕсли;
		Запись.РегистрацияУспех         = ПустаяСтрока(РегистрацияТекстОшибки);
		Запись.РегистрацияДата          = СЭДОФСС.ДатаСообщения(ИдентификаторСообщения85, Кэш);
		Запись.РегистрацияТекстОшибки   = РегистрацияТекстОшибки;
		Запись.РегистрацияИдентификатор = ИдентификаторСообщения85;
		ЗаполнитьСостояниеРегистрации(Запись);
		
		Если ТаблицаСведенийОВыплатах.Количество() > 0 Или Не ЗначениеЗаполнено(РегистрацияТекстОшибки) Тогда
			ТаблицаНеобработанных = СЭДОФСС.ТаблицаЭлементовDOM(НеобработанныеУзлы);
			ДокументОбъект = Документы.СтатусыВыплатыПособия.СоздатьПоСообщению85(Запись,
				ТаблицаСведенийОВыплатах,
				ТаблицаНеобработанных);
			Запись.РегистрацияСсылка = ДокументОбъект.Ссылка;
		КонецЕсли;
		
		ЗавершитьЗаписьНабора(Набор);
	Исключение
		ОтменитьЗаписьНабора(Набор);
		ВызватьИсключение;
	КонецПопытки;
	
	Результат.Обработано = Истина;
КонецПроцедуры

Функция ПредставлениеСпискаОшибокXML(СписокОшибокDOM) Экспорт
	// Для сообщения 321 ожидаемые поля: code,message,details.
	Если СписокОшибокDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	МассивСтрок = Новый Массив;
	Для Каждого ОшибкаDOM Из СписокОшибокDOM.ДочерниеУзлы Цикл
		Если ОшибкаDOM.ТипУзла <> ТипУзлаDOM.Элемент Тогда
			Продолжить;
		КонецЕсли;
		УзлыОшибки = СериализацияБЗК.УзлыЭлементаDOMСКонтролем(ОшибкаDOM, "errorCode, errorDescription");
		Код       = СериализацияБЗК.СтрокаИзXML(УзлыОшибки.errorCode);
		Сообщение = СериализацияБЗК.СтрокаИзXML(УзлыОшибки.errorDescription);
		// Все данные будут записываться в переменную Сообщение.
		Если ЗначениеЗаполнено(Сообщение) Тогда
			Массив = СтрРазделить(Сообщение, Символы.ПС + Символы.ВК, Ложь);
			Сообщение = СтрСоединить(Массив, Символы.ПС + "  ");
		КонецЕсли;
		Если ЗначениеЗаполнено(Код) Тогда
			Сообщение = СокрП(Код + ": " + Сообщение);
		КонецЕсли;
		Если УзлыОшибки.ПредставленияНеобработанныхУзловDOM.Количество() > 0 Тогда
			Необработанные = СтрСоединить(УзлыОшибки.ПредставленияНеобработанныхУзловDOM, Символы.ПС);
			Необработанные = НСтр("ru = 'Необработанные узлы сообщения:'") + Символы.ПС + Необработанные;
			Сообщение = ?(ЗначениеЗаполнено(Сообщение), Сообщение + Символы.ПС + "    " + Необработанные, Необработанные);
		КонецЕсли;
		Если ЗначениеЗаполнено(Сообщение) Тогда
			МассивСтрок.Добавить(Сообщение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
КонецФункции

Функция ТаблицаСведенийОВыплатахXML(paymentStatusList, НеобработанныеУзлы)
	МетаданныеТаблицы = Метаданные.Документы.СтатусыВыплатыПособия.ТабличныеЧасти.СведенияОВыплатах;
	ТаблицаСведенийОВыплатах = КоллекцииБЗК.ТаблицаЗначенийПоМетаданным(МетаданныеТаблицы);
	РеквизитыВыплат = СериализацияБЗК.УзлыЭлементаDOM(paymentStatusList, "paymentStatusDetail", НеобработанныеУзлы);
	ВыплатыDOM = РеквизитыВыплат.paymentStatusDetail;
	Если ВыплатыDOM <> Неопределено Тогда
		Если ТипЗнч(ВыплатыDOM) <> Тип("Массив") Тогда
			ВыплатыDOM = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыплатыDOM);
		КонецЕсли;
		ИменаУзлов = "batchNo, processNum, socialAssistNum, snils, lnNumber, LNCode,
		|paymentDate, stateDate, assignedSumm, paymentSum, paymentState, dutySumm";
		Для Каждого ВыплатаDOM Из ВыплатыDOM Цикл
			Реквизиты = СериализацияБЗК.УзлыЭлементаDOM(ВыплатаDOM, ИменаУзлов, НеобработанныеУзлы);
			СтрокаТаблицы = ТаблицаСведенийОВыплатах.Добавить();
			Если Реквизиты.batchNo <> Неопределено Тогда
				ИдентификаторСтрокиРеестра = СериализацияБЗК.СтрокаИзXML(Реквизиты.batchNo);
				СтрокаТаблицы.ИдентификаторСтрокиРеестра = ИдентификаторСтрокиРеестра;
				СтрокаТаблицы.ИдентификаторРеестра = СтроковыеФункцииБЗККлиентСервер.СтрЛев(ИдентификаторСтрокиРеестра, ":");
			КонецЕсли;
			Если Реквизиты.processNum <> Неопределено Тогда
				СтрокаТаблицы.НомерПроцесса = СериализацияБЗК.ЧислоИзXML(Реквизиты.processNum);
			ИначеЕсли Реквизиты.socialAssistNum <> Неопределено Тогда
				СтрокаТаблицы.НомерПроцесса = СериализацияБЗК.ЧислоИзXML(Реквизиты.socialAssistNum);
			КонецЕсли;
			Если Реквизиты.snils <> Неопределено Тогда
				СтрокаТаблицы.СотрудникСНИЛС = СЭДОФСС.СНИЛСИзXML(Реквизиты.snils);
			КонецЕсли;
			Если Реквизиты.lnNumber <> Неопределено Тогда
				СтрокаТаблицы.НомерЛН = СериализацияБЗК.СтрокаИзXML(Реквизиты.lnNumber);
			ИначеЕсли Реквизиты.LNCode <> Неопределено Тогда
				СтрокаТаблицы.НомерЛН = СериализацияБЗК.СтрокаИзXML(Реквизиты.LNCode);
			КонецЕсли;
			Если Реквизиты.paymentDate <> Неопределено Тогда
				СтрокаТаблицы.Дата = СериализацияБЗК.СтрокаИзXML(Реквизиты.paymentDate);
			ИначеЕсли Реквизиты.stateDate <> Неопределено Тогда
				СтрокаТаблицы.Дата = СериализацияБЗК.СтрокаИзXML(Реквизиты.stateDate);
			КонецЕсли;
			Если Реквизиты.assignedSumm <> Неопределено Тогда
				СтрокаТаблицы.Сумма = СериализацияБЗК.ЧислоИзXML(Реквизиты.assignedSumm);
			ИначеЕсли Реквизиты.paymentSum <> Неопределено Тогда
				СтрокаТаблицы.Сумма = СериализацияБЗК.ЧислоИзXML(Реквизиты.paymentSum);
			КонецЕсли;
			Если Реквизиты.paymentState <> Неопределено Тогда
				СтрокаТаблицы.СтатусВыплаты = СериализацияБЗК.ЧислоИзXML(Реквизиты.paymentState);
			КонецЕсли;
			Если Реквизиты.dutySumm <> Неопределено Тогда
				СтрокаТаблицы.Удержано = СериализацияБЗК.ЧислоИзXML(Реквизиты.dutySumm);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат ТаблицаСведенийОВыплатах;
КонецФункции

Функция ВозможныеСтатусы() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Статус");
	Результат.Колонки.Добавить("Зарегистрирован");
	Результат.Колонки.Добавить("Расшифровка");
	Результат.Колонки.Добавить("Состояние");
	
	// Статусы из актуальной спецификации.
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Статус          = "0";
	СтрокаТаблицы.Зарегистрирован = Ложь;
	СтрокаТаблицы.Расшифровка     = НСтр("ru = 'Не принят Фондом'");
	СтрокаТаблицы.Состояние       = Перечисления.СостоянияДокументаСЭДОФСС.НеПринят;
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Статус          = "1";
	СтрокаТаблицы.Зарегистрирован = Ложь;
	СтрокаТаблицы.Расшифровка     = НСтр("ru = 'Принят'");
	СтрокаТаблицы.Состояние       = Перечисления.СостоянияДокументаСЭДОФСС.Принят;
	
	СтрокаТаблицы = Результат.Добавить();
	СтрокаТаблицы.Статус          = "2";
	СтрокаТаблицы.Зарегистрирован = Истина;
	СтрокаТаблицы.Расшифровка     = НСтр("ru = 'Произошла техническая ошибка. Необходимо повторно отправить документ позже'");
	СтрокаТаблицы.Состояние       = Перечисления.СостоянияДокументаСЭДОФСС.НеПринят;
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьСостояниеРегистрации(Запись) Экспорт
	Запись.Состояние = СостояниеРегистрации(Запись);
КонецПроцедуры

Функция СостояниеРегистрации(Запись)
	
	Если Не ЗначениеЗаполнено(Запись.ДоставкаДата) И Не ЗначениеЗаполнено(Запись.ДатаОтправкиОператору) Тогда
		// Не отправлен.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ПустаяСсылка();
		
	ИначеЕсли ЗначениеЗаполнено(Запись.ДоставкаТекстОшибки) Тогда
		// Ошибка при отправке.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаПриОтправке;
		
	ИначеЕсли Запись.ЕстьОшибкиФЛК Тогда
		// Отправлен, получены ошибки.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОшибкаЛогическогоКонтроля;
		
	ИначеЕсли ЗначениеЗаполнено(Запись.РегистрацияТекстОшибки) Тогда
		// Отправлен, получены ошибки.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.НеПринят;
		
	ИначеЕсли ЗначениеЗаполнено(Запись.РегистрацияДата) Тогда
		// Успешная доставка и регистрация без ошибок.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Принят;
		
	ИначеЕсли Запись.ОтправленОператору И Не Запись.ДоставкаУспех Тогда
		// Передан оператору для доставки.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.ОтправленОператору;
		
	Иначе
		// Отправлен - заполнена дата отправка, нет информации о статусе.
		Возврат Перечисления.СостоянияДокументаСЭДОФСС.Отправлен;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область УведомлениеОСтатусеВыплатыПособия

Процедура ПередУдалениемДокументаЗапросСтатусовВыплатыПособия(ЗапросСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Шапка.ИдентификаторСообщения КАК ИдентификаторСообщения
	|ИЗ
	|	РегистрСведений.РегистрацииЗапросовСтатусовВыплатыПособий КАК Шапка
	|ГДЕ
	|	Шапка.ИсходящийДокумент = &ИсходящийДокумент";
	Запрос.УстановитьПараметр("ИсходящийДокумент", ЗапросСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = НачатьЗаписьНабора(Выборка.ИдентификаторСообщения);
		Если Набор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Набор.Очистить();
		ЗавершитьЗаписьНабора(Набор);
	КонецЦикла;
КонецПроцедуры

Процедура ПередУдалениемДокументаСтатусыВыплатыПособия(СтатусыВыплатыСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Шапка.ИдентификаторСообщения КАК ИдентификаторСообщения
	|ИЗ
	|	РегистрСведений.РегистрацииЗапросовСтатусовВыплатыПособий КАК Шапка
	|ГДЕ
	|	Шапка.РегистрацияСсылка = &РегистрацияСсылка";
	Запрос.УстановитьПараметр("РегистрацияСсылка", СтатусыВыплатыСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = НачатьЗаписьНабора(Выборка.ИдентификаторСообщения);
		Если Набор = Неопределено Или Набор.Количество() = 0 Тогда
			ОтменитьЗаписьНабора(Набор);
			Продолжить;
		КонецЕсли;
		Запись = Набор[0];
		Если Не ЗначениеЗаполнено(Запись.ИсходящийДокумент) Тогда
			Набор.Очистить();
		Иначе
			Запись.РегистрацияСсылка = Неопределено;
		КонецЕсли;
		ЗавершитьЗаписьНабора(Набор);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
